/*****************************************************************************/
/** \file lpm.h
 **
 ** Lpm 数据结构及API声明
 **  
 **
 ** History:
 **   - 2017-06-06        V1.0
 **
 *****************************************************************************/

#ifndef __LPM_H__
#define __LPM_H__

/*****************************************************************************
 * Include files
 *****************************************************************************/
#include "ddl.h"

#ifdef __cplusplus
extern "C"
{
#endif

/**
 *******************************************************************************
 ** \defgroup LpmGroup Low Power Management (LPM)
 **
 **
 ******************************************************************************/
//@{
    
/******************************************************************************
 ** Global pre-processor symbols/macros ('#define')                            
 ******************************************************************************/

/******************************************************************************
 * Global type definitions
 ******************************************************************************/

 /**
 ******************************************************************************
 ** \brief 事件挂起使能枚举重定义 (SEVONPEND)
 *****************************************************************************/
typedef enum en_lpm_sevonpend
{
    SevPndDisable = 0u,            ///< 事件挂起禁止
    SevPndEnable  = 1u,            ///< 事件挂起使能
}en_lpm_sevonpend_t; 
 
 /**
 ******************************************************************************
 ** \brief 深度睡眠使能枚举重定义 (SLEEPDEEP)
 *****************************************************************************/
typedef enum en_lpm_sleepdeep
{
    SlpDpDisable = 0u,            ///< 深度睡眠禁止
    SlpDpEnable  = 1u,            ///< 深度睡眠使能
}en_lpm_sleepdeep_t;

/**
 ******************************************************************************
 ** \brief 异常退出进睡眠使能枚举重定义 (SLEEPONEXIT)
 *****************************************************************************/
typedef enum en_lpm_sleeponexit
{
    SlpExtDisable = 0u,            ///< 异常退出进睡眠禁止
    SlpExtEnable  = 1u,            ///< 异常退出进睡眠使能
}en_lpm_sleeponexit_t;

/**
 ******************************************************************************
 ** \brief 唤醒模式选择枚举重定义 (WAKEUP_DPSP)
 *****************************************************************************/
typedef enum en_lpm_wakeupmode
{
    LpmWakeupUseNVIC        = 0u,       ///< 使用NVIC系统控制寄存器控制唤醒使能
    LpmWakeupUseWAKEUP_DPSP = 1u,       ///< 使用WAKEUP_DPSP寄存器控制唤醒使能
}en_lpm_wakeupmode_t;

/**
 ******************************************************************************
 ** \brief 深度休眠唤醒使能控制枚举重定义 (WAKEUP_DPSP)
 *****************************************************************************/
typedef enum en_lpm_wakeupen
{
    LpmWakeupDisable        = 0u,       ///< 唤醒功能禁止
    LpmWakeupEnable         = 1u,       ///< 唤醒功能使能
}en_lpm_wakeupen_t;

/**
 ******************************************************************************
 ** \brief Low Power Mode 配置结构体定义 
 *****************************************************************************/
typedef struct stc_lpm_config
{
    en_lpm_sevonpend_t   enSEVONPEND;        ///< 使能:每次新中断会产生一个事件,如果使用WFE休眠,则可用于唤醒处理器.
    en_lpm_sleepdeep_t   enSLEEPDEEP;        ///< 使能:执行WFI进入深度休眠;不使能:执行WFI进入休眠.        
    en_lpm_sleeponexit_t enSLEEPONEXIT;      ///< 使能:退出异常处理并返回时,处理器自动进入休眠模式;不使能:该特性禁止.
}stc_lpm_config_t;

/******************************************************************************
 * Global variable declarations ('extern', definition in C source)
 *****************************************************************************/

/******************************************************************************
 * Global function prototypes (definition in C source)
 *****************************************************************************/
//功能配置及操作函数
//低功耗模式配置
en_result_t Lpm_Config(stc_lpm_config_t* pstcConfig);
//进入低功耗模式
void Lpm_GotoLpmMode(void);

//@} // LpmGroup

#ifdef __cplusplus
#endif


#endif /* __LPM_H__ */
/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/


